tiborsimon/embedded-tdd-headers/pic/pic16/pic16f527_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F527_H_
#define _PIC16F527_H_

#define INDF                          0
#define TMR0                          1
#define PCL                           2
#define STATUS                        3
#define STATUS_C                      4
#define CARRY                         5
#define STATUS_DC                     6
#define ZERO                          7
#define STATUS_Z                      8
#define STATUS_nPD                    9
#define STATUS_nTO                    10
#define STATUS_PA0                    11
#define STATUS_PA1                    12
#define FSR                           13
#define OSCCAL                        14
#define CAL0                          15
#define CAL                           16
#define CAL1                          17
#define CAL2                          18
#define CAL3                          19
#define CAL4                          20
#define CAL5                          21
#define CAL6                          22
#define PORTA                         23
#define RA0                           24
#define RA                            25
#define RA1                           26
#define RA2                           27
#define RA3                           28
#define RA4                           29
#define RA5                           30
#define PORTB                         31
#define RB4                           32
#define RB                            33
#define RB5                           34
#define RB6                           35
#define RB7                           36
#define PORTC                         37
#define RC0                           38
#define RC                            39
#define RC1                           40
#define RC2                           41
#define RC3                           42
#define RC4                           43
#define RC5                           44
#define RC6                           45
#define RC7                           46
#define ADCON0                        47
#define ADON                          48
#define GO_nDONE                      49
#define NOT_DONE                      50
#define GO                            51
#define CHS                           52
#define CHS0                          53
#define CHS1                          54
#define CHS2                          55
#define CHS3                          56
#define ADCS                          57
#define ADCS0                         58
#define ADCS1                         59
#define ADRES                         60
#define ADRES0                        61
#define ADRES1                        62
#define ADRES2                        63
#define ADRES3                        64
#define ADRES4                        65
#define ADRES5                        66
#define ADRES6                        67
#define ADRES7                        68
#define INTCON0                       69
#define GIE                           70
#define RAIF                          71
#define T0IF                          72
#define CWIF                          73
#define ADIF                          74
#define EECON                         75
#define RD                            76
#define WR                            77
#define WREN                          78
#define WRERR                         79
#define FREE                          80
#define EEDATA                        81
#define EEADR                         82
#define CM1CON0                       83
#define nC1WU                         84
#define C1PREF                        85
#define C1NREF                        86
#define C1ON                          87
#define nC1T0CS                       88
#define C1POL                         89
#define nC1OUTEN                      90
#define C1OUT                         91
#define CM2CON0                       92
#define nC2WU                         93
#define C2PREF1                       94
#define C2NREF                        95
#define C2ON                          96
#define C2PREF2                       97
#define C2POL                         98
#define nC2OUTEN                      99
#define C2OUT                         100
#define VRCON                         101
#define VR0                           102
#define VR                            103
#define VR1                           104
#define VR2                           105
#define VR3                           106
#define VRR                           107
#define VROE                          108
#define VREN                          109
#define ANSEL                         110
#define ANS0                          111
#define ANS1                          112
#define ANS2                          113
#define ANS3                          114
#define ANS4                          115
#define ANS5                          116
#define ANS6                          117
#define ANS7                          118
#define IW                            119
#define IWREG                         120
#define INTCON1                       121
#define WUR                           122
#define RAIE                          123
#define T0IE                          124
#define CWIE                          125
#define ADIE                          126
#define ISTATUS                       127
#define ISTATUS_C                     128
#define ISTATUS_DC                    129
#define ISTATUS_Z                     130
#define ISTATUS_nPD                   131
#define ISTATUS_nTO                   132
#define ISTATUS_PA0                   133
#define ISTATUS_PA1                   134
#define IFSR                          135
#define IBSR                          136
#define OPACON                        137
#define OPA1ON                        138
#define OPA2ON                        139

#endif // _PIC16F527_H_
